[Main]
Abort=中断
About=关于
Add=添加
Address=地址
AddressNotFound=地址 "%.8x" 未找到
AddressUsedByProcedure=地址被流程 "%s" 使用
AddWatermark=新建水印
All=所有
AllFiles=所有文件
AllProcedures=所有流程
AutoSaveProject=编译后自动保存项目文件
Back=上一步
Best=最佳 (解压速度较慢)
BreakAddress=流程末端
Calculate=计算
Calculator=计算器
Calls=程序调用
Cancel=取消
ClearHistory=清空历史记录
Close=关闭
CloseFolders=收缩所有节点
CodeSectionNotFound=区段 "CODE" 未找到
CommandNotSupport=不支持的命令
Commands=汇编
CommandsWithConditions=内部条件汇编
CompilationType=编译类型
Compile=编译
Compiled=编译完成
CompilerMessages=编译器消息
ConditionalJumps=条件跳转
Confirm=确认
Contents=帮助内容
Continue=继续
Copy=复制
Count=数量
CreateFileError=无法创建文件 "%s"
CryptValues=隐藏常量
Cut=剪切
Debug=调试模式 (搜索外部地址)
Debugger=检测调试器
DecreaseIsSpeed=降低运行速度
Del=删除
Delete=删除
Deleting=正在删除
DelFolder=删除节点
DelProcedure=删除流程
DelWatermark=删除水印
Demo=演示版
DemoLimit=未注册版只能处理一个流程
Detection=检测
Direction=方向
Directories=目录表
DoFind=查找
Down=向下
DragFileToOpen=拖放要打开的文件到这里
Dump=转储
DynamicOnlineCommands=动态创建联机命令
Edit=编辑
EditFolder=编辑节点
EditProcedure=编辑流程
EditWatermark=编辑水印
EmptyCompile=未找到要编译的数据
EmptyFileName=未指定文件名称
EmptyModule=未指定模块
EmptyProcess=未指定进程
EnabledForUse=允许使用
EncryptRegisters=离开虚拟机时加密寄存器
Error=错误
Execute=运行
ExecutedFiles=可执行文件
Exit=退出
Expert=专家模式
Export=输出表
ExtAddress=外部地址
ExternalAdresses=外部地址
Fast=快速 (解压速度较快)
File=文件
FileInfo=文件信息
FileIsNotDLL=文件 "%s" 不是 x%d DLL文件
FileName=文件名称
FileOffset=文件偏移
FilePacked=文件 "%s" 可能已经被压缩过。仍然要载入此文件吗?
FileUnknownFormat=文件 "%s" 是未知格式
Find=查找
FindNext=查找下一个
Flags=标记
FoundUnpairedMarkers=发现 %d 未闭合的标识
Generate=生成
Goto=前往地址
Help=帮助
Hint=提示
HomePage=官方主页
Ignore=忽略
Import=输入表
ImportProtection=输入表保护
IncludeInCompilation=包含在编译
Information=信息
InvalidAddress=无效的地址
InvalidCPUType=处理器 "%s" 不支持
InvalidFormat=文件 "%s" 是错误的 %s 格式
InvalidKeyID=无效的密钥标识
InvalidOSType=操作系统 "%s" 不支持
JmpOnExternalAddress=跳到外部地址: %.8x
JmpOnInternalAddress=跳到内部地址: %.8x
JumpOnCommandPart=多指令跳转
Jumps=跳转
Key=密钥
KeyIdentifier=密钥标识
Language=语言
Legend=说明
Level=级别
License=授权
LicenseNumber=授权码
LicenseOptions=授权设置选项
LicenseDataNotFound=在文件 "%s" 中未找到授权数据
LicensingParameters=授权参数设置
LicensingSystemNotSupport=该版本不支持授权系统
Loading=载入
LockToKey=绑定密钥
LockToSerialNumber=绑定注册码
MAPFileHaveIncorrectTimeStamp=MAP文件的时间戳错误，无法被加载
MasterKeyPassword=主密钥密码
MatchCase=区分大小写
MaxProtection=最大保护(程序运行速度较慢)
MaxSpeed=最快速度(程序运行速度较快)
MemoryProtection=内存保护
MinGateSize=编译流程的最小大小为 5 字节
Module=模块
ModuleOpenError=无法打开模块 "%s"
ModuleUnknownFormat=模块 "%s" 是未知格式
MoveDown=向下移动
MoveResourcesToEnd=挪动资源到文件尾部
MoveUp=向上移动
Mutation=变异
Name=名称
New=新建
NewFolder=新建节点
NewObjects=新增标记/字符串 
NewProcedure=新建流程
Next=下一步
No=否
NoPlaceForGate=没有足够的空间来创建适配器
NoToAll=取消所有
NotUseLicense=不使用授权
OK=确定
OnlineCommands=联机命令
Open=打开
OpenFile=打开文件
OpenFolders=展开所有节点
OpenNewFile=打开新文件
OptionAvialable=选项 "%s" 无法在未注册版中使用
Options=选项
Ordinal=序数
Other=其他
OutputFile=输出文件
OutputFileSize=输出文件大小 %d 字节 (%d%%)
Packing=压缩
PackOutputFile=压缩输出文件
Parameters=参数
Paste=粘贴
Pointer=地址
Procedure=流程
ProcedureNotFoundInMAP=对象列表中未找到流程 "%s"
ProceduresForProtect=要保护的流程
Process=进程
Project=项目
ProjectFile=项目文件
ProjectFiles=项目文件
PushOriginalAddress=保存源地址到堆栈: %.8x
Redo=重做
References=参考
RegisteredTo=注册给
RelativeAddress=相对地址
Resources=资源
Retry=重试
RunnerCRC=检查虚拟机对象的完整性
SaveProject=保存项目
SaveProjectAs=项目另存为
Script=脚本
ScriptFile=脚本文件
ScriptMessages=脚本消息
Search=搜索
SearchInFile=在文件中搜索
SearchInProcess=在进程中搜索
Section=区段
SectionNotPacked=区段 "%s" 不能被压缩
SectionPosUsedByDir=目录 "%s" 处于创建新区段的头部
SectionPosUsedBySection=区段 "%s" 处于创建新区段的头部
Sections=区段表
SEHNotSupported=不支持处理例外表: %.8x
SelectAll=选择所有
SelectProceduresForProtect=选择要保护的流程
Settings=设置
Setup=设置
ShellExt=整合右键菜单
ShowAll=显示所有
Size=大小
SortByName=按名称排列流程列表吗？
SortByType=按编译类型排列流程列表吗？
String=字符串
Strings=字符串
StringDeprecated=使用函数VMProtectDecryptStringA/VMProtectDecryptStringW加密字符串
StripFixups=移除固定元素 (EXE文件)
Text=文本
TextNotFound=文本 "%s" 未找到
Thanks=感谢
Toolbars=工具条
Tools=工具
Type=类型
Ultra=超级 (变异 + 虚拟)
Undo=撤消
Unregistered=未注册
Up=向上
Usage=使用
UseLicense=使用授权
UseProjectOptions=使用项目选项
UserPIN=用户PIN
Value=值
ValuesFor=值为
Variable=变量
Version=版本
VersionNumber=版本号
View=查看
Virtualization=虚拟
VirtualMachines=虚拟计算机
VMSections=VM 区段
VMTools=虚拟工具 (VMware/Virtual PC/Sandboxie)
Warning=警告
WatermarkCount=未注册版只能创建一个水印
WatermarkDisabled=水印 "%s" 开启/关闭
WatermarkExist=水印 "%s" 已存在
WatermarkName=水印名称
WatermarkNotFound=水印 "%s" 未能在水印列表中找到
Watermarks=水印
WatermarkUsed=水印 "%s" 已经被保护文件使用
Wizard=向导模式
Yes=是
YesToAll=确定所有

[Manager]
About...=关于(&A)...
Contents...=帮助(&H)...
Customers=客户管理(&C)
Edit=编辑(&E)
File=文件(&F)
Help=帮助(&H)
New=新建(&N)
Open...=打开(&O)...
Licenses=授权管理(&L)
Products=产品管理(&P)
Save=保存(&S)
View=查看(&V)
AboutComment=显示"关于"窗口
AboutTitle=关于
AboutTooltip=关于
ContentsComment=显示帮助
ContentsTooltip=帮助
AddCustomer=添加客户
Address=详细地址
Blocked=授权屏蔽
Cancel=取消
Change=变更
ChangeWindowPos=变更窗体位置
ChangeWindowSize=变更窗体大小
CloseWindow=Close 关闭窗体
Comments=备注信息
Customer=客户
CustomerProperties=客户属性
CustomerDetails=客户信息
Date=授权日期
Delete=删除
Discount=Discount
Exit=退出(&E)
EMail=电子邮箱
Edit=编辑
ExitComment=退出程序
LanguageWillBeChangedAtTheNextStart=更改语言设定将在下次程序重启后生效
MaximizeWindow=窗体最大化
MinimizeWindow=窗体最小化
NewCustomer=新建客户
NewDocComment=新建数据库
NewDocTooltip=新建
NewLicense=新建授权
NewProduct=新建产品
No=否
Yes=是
OK=确定
OpenDocComment=打开现有的数据库
OpenDocTooltip=打开
OpenMRU=打开文档
License=授权
LicenseProperties=授权属性
LicenseDetails=授权信息
Licenses by Customers=依客户显示授权(&C)
Licenses by Products=依产品显示授权(&P)
Phone=联络电话
Price=价格
ProductTitle=产品主题
ProductProperties=产品属性
ProductDetails=产品信息
Ready=准备
Recent File=最近打开的文件
Referrer=Referrer
RestoreWindow=恢复窗体大小
Save As...=另存为(&A)...
Save changes to %1?=保存变更到 %1?
SaveAsDocComment=当前数据库另存为
SaveDocComment=保存当前数据库
SaveDocTooltip=保存
SelectCustomer=选择客户
SerialNumber=注册码
Show Status Bar=显示 状态栏(&S)
Show Toolbar=显示 工具栏(&T)
ShowStatusbarComment=显示状态栏
ShowToolbarComment=显示工具栏
Site=所在地区
Title=产品主题
Version=版本

CustomerProperties=客户属性
LicenseProperties=授权属性
ProductProperties=产品属性
Language=语言

EditObject=对象属性...
DeleteObjectComment=删除选择的对象
EditObjectComment=显示选择的对象属性
CustomersComment=显示客户
NewCustomerComment=创建新的客户
NewLicenseComment=创建新的授权
NewProductComment=创建新的产品
LicensesByCustomersComment=依客户显示授权
LicensesByProductComment=依产品显示授权
LicensesComment=显示授权
ProductsComment=显示产品

DeleteObjectTooltip=删除对象
EditObjectTooltip=编辑对象
CustomersTooltip=客户
NewCustomerTooltip=新建客户
NewLicenseTooltip=新建授权
NewProductTooltip=新建产品
LicensesByCustomersTooltip=依客户显示授权
LicensesByProductTooltip=依产品显示授权
LicensesTooltip=授权
ProductsTooltip=产品

UnableToOpenFile=打开文件 "%s" 失败.\n文件中断或你没有足够的访问权限.\n\n详细错误信息:\n%s.
UnableToSaveFile=保存文件 "%s" 失败.\n确保你有足够的访问权限以及足够的磁盘空间.\n\n错误代码: %d.

OpenLastDocument=自动打开上一次开启的文档

Undo=撤销(&U)
UndoComment=撤销上一次操作
UndoTooltip=撤销
Redo=重做(&R)
RedoComment=重试上一次操作
RedoTooltip=重试

DatabaseErrorDetails=%s\n错误代码: %d

SerialNumberAlgorithm=注册算法
AlgorithmBits=算法长度
ProductNewKeyPair=你将会初始化该产品的密钥对.\n这将会导致之前该产品生成的注册码失效.\n你需要用新生成的密钥重新保护你的程序.\n\n你确定需要变更密钥?

Undefined=未定义
SerialNumberWillBeGenerated=按下确定按钮生成注册码.
NeedToSelectCustomer=你必须选择客户来创建授权.

Unknown=未知
LicenseSettingsFileFilter=授权项目
...=...
PathToSettingsFile=授权项目
NeedToSetTitle=请设置产品标题.

ExceptionFormatString=发生了未知错误!请将错误信息发送给作者.\n按Ctrl+C复制错误信息.\n\n异常类型: %s\n位置: %s\n错误信息:\n%s

UnableToSaveSettingsFile=保存VMProtect设定失败!\n请确认路径是否正确并且有足够的访问权限.\n文件: %s\n错误代码: %d


CustomerName=客户名称
DatabaseLicenseData=授权信息
SerialNumberLicenseData=注册码信息
Block=屏蔽注册码
Unblock=开启注册码
CopySerialNumber=复制注册码
OrderRef=订单号#
HardwareID=硬件码
ExpDate=有效期
RunningTimeLimit=运行时间限制
UserData=使用者信息
ShowLicenses=显示授权
(minutes)=(分钟)
SerialNumberData=注册码信息 (字节 使用: %d of %d)
NewLicenseFieldIsTooLong=字段 "%s" 太长了: %d 字节.\n最大允许字节数: %d (UTF-8编码方式).
InvalidHardwareId=硬件码错误或者为空.
SerialNumberDataIsTooLong=注册码没有足够的空间来存放数据.\n最大允许字节数: %d, 已使用: %d.
UserDataIsTooLong="用户信息"没有足够的空间来存放数据.\n最大允许字节数: %d, 已使用: %d.

FindLicense=查找授权
FindLicenseComment=查找授权
FindLicenseTooltip=查找授权
ImportLicense=导入授权
ImportLicenseComment=导入授权
ImportLicenseTooltip=导入授权
PasteSerialNumber=输入注册码:
FindLicenseCantFindSerialNumber=数据库中找不到该注册码.\n没有包含该注册码的产品.
FindLicenseDoYouWantToImport=产品 "%s" 包含该注册码.\n是否导入该注册码到数据库?
ImportSerialNumberAlreadyExist=数据库中已经存在该注册码.\n你不能重复导入.
ImportLicenseInvalidSerialNumber=数据库中找不到包含该注册码的产品.

Untitled=未定义
VMPLMDocument=授权管理数据库
VMPLicenseManager=VMProtect 授权管理
Filter=过滤:

ProductCode=产品代码
MaxBuildDate=最终创建日期

ExportKeyPair=导出密钥对
ProductKeyChangedCommitFirst=你已经变更了密钥参数.\n为了正确导出,请在产品属性窗口按"确定"来保存变更.
Close=关闭
KeyPairExportTarget=导出格式:
KeyPairExportResult=导出结果:
ExportForKeyGenDll=KeyGen.dll 参数(MSVC)
ExportForKeyGenDll_PAS=KeyGen.dll 参数(Delphi) 
ExportForKeyGenPHP=keygen.php 参数
ExportForKeyGenNet=KeyGen.Net 参数
Copy=复制

FilterBox=更改过滤
FilterBoxComment=更改过滤
FilterBoxTooltop=更改过滤
FilterCueBanner=过滤

HardwareId_Part_CPU=CPU
HardwareId_Part_Host=主机
HardwareId_Part_Mac=网卡
HardwareId_Part_HDD=HDD
HWIDParser=硬件码信息
HWIDParser_Column_Type=设备
HWIDParser_Column_Value=标识
DoYouWantToCreateCustomerByLicense=注册码中定义了客户信息,但是数据库中找不到该客户.\n你是否需要创建一个客户??

AboutHome=官方主页
AboutEMail=电子邮箱
AboutWarning=警告: 本程序受计算机软件法律及《计算机软件保护条例》保护.未经软件著作权人许可,任何复制或者部分复制;向公众发行、出租、通过信息网络传播;修改、翻译、反编译或其他侵犯软件著作权的行为,都将依法追究其法律责任.

NoHelpFile=打开帮助文件失败